app/controllers/client_cards_controller.rb

  def index
    @client_cards = @user.client_cards.all
---
SELECT  "client_cards".* FROM "client_cards" WHERE "client_cards"."user_id" = ? AND "client_cards"."id" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def create
    @client_card = @user.client_cards.new(client_card_params)
    if @client_card.save
---
INSERT INTO "client_cards" ("title", "many", "description", "deadlines", "contract_id", "action_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def find_client_card
      @client_card = ClientCard.find(params[:user_id])
---
SELECT  "client_cards".* FROM "client_cards" WHERE "client_cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]