app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @client_cards = @user.client_cards.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "client_cards".* FROM "client_cards" WHERE "client_cards"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 11], ["OFFSET", 0]]
SELECT COUNT(*) FROM "client_cards" WHERE "client_cards"."user_id" = ?  [["user_id", 1]]

  def update
    @user.update(user_params)
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "kira"], ["email", "kira@dura.ru"], ["password_digest", "$2a$10$TxPdb2nWptiQH1q3GCmehuDepuWt33Q.jDQmJ7Xk04Vprl.DlWeQe"], ["updated_at", "2020-01-27 16:13:38.055972"], ["id", 1]]